# 5.4. Цвета пришельцев 2.
# Выберите цвет, как это было сделано в упражнении 5.3, и напишите цепочку if-else.
# • Напишите оператор if для проверки того, что переменная содержит значение
# 'green'. Если условие истинно, то выведите сообщение о том, что игрок только
# что заработал 5 очков.
# • Если переменная содержит любое другое значение, то выведите сообщение о том,
# что игрок только что заработал 10 очков.
# • Напишите одну версию программы, в которой выполняется блок if, и другую,
# в которой выполняется блок else.

alien_color = 'red'

if alien_color == 'green':
    print('You earn 5 points!')
else:
    print('You earn 10 points!')
