# 5.3. Цвета пришельцев 1. Представьте, что в вашей компьютерной игре только что
# был подбит корабль пришельцев. Создайте переменную alien_color и при-свойте ей
# значение 'green', 'yellow' или 'red'.
# • Напишите оператор if для проверки того, что переменная содержит значение
# 'green'. Если условие истинно, то выведите сообщение о том, что игрок только
# что заработал 5 очков.
# • Напишите одну версию программы, в которой условие if выполняется, и другую,
# в которой оно не выполняется. (Во второй версии никакое сообщение
# выводиться не должно.)

alien_color = 'green'

if alien_color == 'green':
    print('You earn 5 points!')

if alien_color == 'red':
    print('You earn 5 points!')