# 5.5. Цвета пришельцев 3.
# Преобразуйте цепочку if-else из упражнения 5.4в цепочку if-elif-else.
# • Если переменная содержит значение 'green', выведите сообщение о том, что
# игрок только что заработал 5 очков.
# • Если переменная содержит значение 'yellow', выведите сообщение о том,
# что игрок только что заработал 10 очков.
# • Если переменная содержит значение 'red', выведите сообщение о том, чтои
# грок только что заработал 15 очков.
# • Напишите три версии программы и проследите за тем, чтобы для каждого цвета
# пришельца выводилось соответствующее сообщение.

alien_color = 'red'

if alien_color == 'green':
    print('You earn 5 points!')
elif alien_color == 'yellow':
    print('You earn 10 points!')
elif alien_color == 'red':
    print('You earn 15 points!')

