# 7.1. Каршеринг. Напишите программу, которая спрашивает у пользователя,
# какую машину он хотел бы взять напрокат. Выведите сообщение с
# введенными данными (например, «Посмотрим, смогу ли я найти вам Subaru»).

selected_car = input('Select a car: ')
print(f'Selected car is {selected_car}')