# 4.7. Тройки. Создайте список чисел, кратных 3, в диапазоне от 3 до 30.
# Выведите все числа списка в цикле for.

for i in range(3,31,+3):
	print(i)