# 4.1. Пицца. Вспомните по крайней мере три названия ваших любимых видов
# пиццы. Сохраните их в списке и используйте цикл for для вывода всех названий.
# • Измените цикл for так, чтобы вместо простого названия пиццы выводилось
# сообщение, содержащее это название. Таким образом, для каждого элемента
# должна выводиться строка с простым текстом вида «Я люблю пиццу пеперони».
# • Добавьте в конец программы (после цикла for) строку, в которой будет указано,
# насколько вы любите пиццу. Таким образом, вывод должен состоять из трех (и более)
# строк с названиями пиццы и дополнительного предложения — скажем, «Я очень люблю пиццу!»

pizzaList = ['Pepperoni', '4Cheese', 'Margarita']
for pizza in pizzaList:
	print(pizza)